using Microsoft.EntityFrameworkCore.Migrations;
using Npgsql.EntityFrameworkCore.PostgreSQL.Metadata;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace franko_bot.Migrations
{
    /// <inheritdoc />
    public partial class add_faculty_and_speciality_tables : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropColumn(
                name: "Faculty",
                table: "Users");

            migrationBuilder.AddColumn<int>(
                name: "FacultyId",
                table: "Users",
                type: "integer",
                nullable: false,
                defaultValue: 0);

            migrationBuilder.AddColumn<int>(
                name: "SpecialityId",
                table: "Users",
                type: "integer",
                nullable: false,
                defaultValue: 0);

            migrationBuilder.CreateTable(
                name: "Faculty",
                columns: table => new
                {
                    Id = table.Column<int>(type: "integer", nullable: false)
                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                    Name = table.Column<string>(type: "text", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Faculty", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Speciality",
                columns: table => new
                {
                    Id = table.Column<int>(type: "integer", nullable: false)
                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                    Code = table.Column<string>(type: "character varying(4)", maxLength: 4, nullable: false),
                    Name = table.Column<string>(type: "text", nullable: false),
                    FacultyId = table.Column<int>(type: "integer", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Speciality", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Speciality_Faculty_FacultyId",
                        column: x => x.FacultyId,
                        principalTable: "Faculty",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.InsertData(
                table: "Faculty",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Біологічний факультет" },
                    { 2, "Географічний факультет" },
                    { 3, "Геологічний факультет" },
                    { 4, "Економічний факультет" },
                    { 5, "Історичний факультет" },
                    { 6, "Механіко-математичний факультет" },
                    { 7, "Факультет електроніки та комп’ютерних технологій" },
                    { 8, "Факультет журналістики" },
                    { 9, "Факультет іноземних мов" },
                    { 10, "Факультет культури і мистецтв" },
                    { 11, "Факультет міжнародних відносин" },
                    { 12, "Факультет педагогічної освіти" },
                    { 13, "Факультет прикладної математики та інформатики" },
                    { 14, "Факультет управління фінансами та бізнесу" },
                    { 15, "Фізичний факультет" },
                    { 16, "Філологічний факультет" },
                    { 17, "Філософський факультет" },
                    { 18, "Хімічний факультет" },
                    { 19, "Юридичний факультет" },
                    { 20, "Черкаське навчально-наукове відділення" }
                });

            migrationBuilder.InsertData(
                table: "Speciality",
                columns: new[] { "Id", "Code", "FacultyId", "Name" },
                values: new object[,]
                {
                    { 1, "091", 1, "Біологія" },
                    { 2, "162", 1, "Біотехнології та біоінженерія" },
                    { 3, "101", 1, "Екологія" },
                    { 4, "014", 1, "Середня освіта/Середня освіта (біологія та здоров’я людини)" },
                    { 5, "106", 2, "Географія" },
                    { 6, "106", 2, "Географія/Економічна і соціальна географія" },
                    { 7, "106", 2, "Географія/Урбаністика, просторове планування і регіональний розвиток" },
                    { 8, "241", 2, "Готельно-ресторанна справа" },
                    { 9, "103", 2, "Науки про Землю/Геоекологія і прикладна геоморфологія" },
                    { 10, "103", 2, "Науки про Землю/Ґрунтознавство та експертна оцінка земель" },
                    { 11, "014", 2, "Середня освіта/Середня освіта (Географія)" },
                    { 12, "242", 2, "Туризм/Туристична діяльність" },
                    { 13, "181", 2, "Харчові технології" },
                    { 14, "103", 3, "Науки про Землю/Геологія. Комп’ютерні технології в науках про Землю" },
                    { 15, "103", 3, "Науки про Землю/Геотехнічний та екологічний інжиніринг" },
                    { 16, "051", 4, "Економіка/Бізнес-економіка" },
                    { 17, "051", 4, "Економіка/Економіка та правове регулювання в бізнесі" },
                    { 18, "051", 4, "Економіка/Економічна аналітика та бізнес-статистика" },
                    { 19, "051", 4, "Економіка/Економічна кібернетика" },
                    { 20, "051", 4, "Економіка/Міжнародна економіка" },
                    { 21, "075", 4, "Маркетинг" },
                    { 22, "073", 4, "Менеджмент/Менеджмент організацій і адміністрування" },
                    { 23, "073", 4, "Менеджмент/Менеджмент організацій і адміністрування. Інформаційні системи у менеджмент" },
                    { 24, "071", 4, "Облік і оподаткування/Діджитал облік, бізнес-консалтинг і аудит" },
                    { 25, "071", 4, "Облік і оподаткування/Облік, аналіз і оподаткування в бізнесі" },
                    { 26, "076", 4, "Підприємництво, торгівля та біржова діяльність" },
                    { 27, "072", 4, "Фінанси, банківська справа та страхування" },
                    { 28, "032", 5, "Історія та археологія" },
                    { 29, "014", 5, "Середня освіта/Середня освіта (Історія)" },
                    { 30, "054", 5, "Соціологія/Прикладна соціологія. Бізнес-соціологія" },
                    { 31, "111", 6, "Математика/Комп’ютерна алгебра, криптологія та теорія ігор" },
                    { 32, "111", 6, "Математика/Комп’ютерний аналіз математичних моделей" },
                    { 33, "111", 6, "Математика/Математика. Математична економіка та економетрика" },
                    { 34, "111", 6, "Математика/Фінансова та страхова математика" },
                    { 35, "113", 6, "Прикладна математика/Математичне моделювання та комп’ютерна механіка" },
                    { 36, "014", 6, "Середня освіта/Середня освіта (Математика)" },
                    { 37, "112", 6, "Статистика/Статистичний аналіз даних" },
                    { 38, "121", 20, "Інженерія програмного забезпечення" },
                    { 39, "073", 20, "Менеджмент" },
                    { 40, "071", 20, "Облік і оподаткування" },
                    { 41, "081", 20, "Право" },
                    { 42, "072", 20, "Фінанси, банківська справа та страхування" },
                    { 43, "171", 7, "Електроніка/Електроніка та комп’ютерні системи" },
                    { 44, "121", 7, "Інженерія програмного забезпечення/Високопродуктивний комп’ютинг" },
                    { 45, "121", 7, "Інженерія програмного забезпечення" },
                    { 46, "126", 7, "Інформаційні системи та технології" },
                    { 47, "122", 7, "Комп’ютерні науки" },
                    { 48, "153", 7, "Мікро- та наносистемна техніка/Сенсорні та діагностичні електронні системи" },
                    { 49, "061", 8, "Журналістика" },
                    { 50, "035", 9, "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – англійська: переклад (англійська та друга іноземні мови))" },
                    { 51, "035", 9, "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – німецька: німецька та англійська мови і літератури (переклад включно))" },
                    { 52, "035", 9, "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – англійська: англійська та друга іноземні мови і літератури)" },
                    { 53, "035", 9, "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – німецька: переклад (німецька і друга іноземна мови, міжкультурна комунікація))" },
                    { 54, "035", 9, "Філологія/Філологія (Класичні мови та літератури (переклад включно): класична філологія і англійська мова)" },
                    { 55, "035", 9, "Філологія/Філологія (Романські мови та літератури (переклад включно), перша – іспанська: іспанська та англійська мови і літератури)" },
                    { 56, "035", 9, "Філологія/Філологія (Романські мови та літератури (переклад включно), перша – французька: французька та англійська мови і літератури)" },
                    { 57, "029", 10, "Інформаційна, бібліотечна та архівна справа" },
                    { 58, "028", 10, "Менеджмент соціокультурної діяльності" },
                    { 59, "025", 10, "Музичне мистецтво/Хорове диригування" },
                    { 60, "014", 10, "Середня освіта/Середня освіта (Музичне мистецтво)" },
                    { 61, "026", 10, "Сценічне мистецтво/Акторське мистецтво драматичного театру та кіно" },
                    { 62, "026", 10, "Сценічне мистецтво/Театрознавство" },
                    { 63, "024", 10, "Хореографія" },
                    { 64, "293", 11, "Міжнародне право" },
                    { 65, "291", 11, "Міжнародні відносини, суспільні комунікації та регіональні студії/Країнознавство" },
                    { 66, "291", 11, "Міжнародні відносини, суспільні комунікації та регіональні студії/Міжнародна безпека та кризовий менеджмент" },
                    { 67, "291", 11, "Міжнародні відносини, суспільні комунікації та регіональні студії/Міжнародна інформація" },
                    { 68, "291", 11, "Міжнародні відносини, суспільні комунікації та регіональні студії/Міжнародні відносини" },
                    { 69, "292", 11, "Міжнародні економічні відносини/Міжнародний бізнес" },
                    { 70, "292", 11, "Міжнародні економічні відносини" },
                    { 71, "012", 12, "Дошкільна освіта" },
                    { 72, "011", 12, "Освітні, педагогічні науки/Організація освітнього простору. Позашкільна освіта." },
                    { 73, "013", 12, "Початкова освіта" },
                    { 74, "013", 12, "Початкова освіта/Початкова освіта. Англійська мова у початковій школі" },
                    { 75, "013", 12, "Початкова освіта/Початкова освіта. Інформатика у початковій школі" },
                    { 76, "231", 12, "Соціальна робота/Соціальна педагогіка" },
                    { 77, "016", 12, "Спеціальна освіта/Логопедія" },
                    { 78, "016", 12, "Спеціальна освіта/Олігофренопедагогіка. Корекційна психопедагогіка" },
                    { 79, "125", 13, "Кібербезпека/Кібербезпека. Кіберпезпека у фінансових технологіях" },
                    { 80, "122", 13, "Комп’ютерні науки/Інформатика" },
                    { 81, "113", 13, "Прикладна математика" },
                    { 82, "014", 13, "Середня освіта/Середня освіта (Інформатика)" },
                    { 83, "124", 13, "Системний аналіз/Системний аналіз і управління. Інтелектуальний аналіз даних" },
                    { 84, "051", 14, "Економіка/Інформаційні технології в бізнесі" },
                    { 85, "071", 14, "Облік і оподаткування/Облік, аналіз та фінансові розслідування" },
                    { 86, "281", 14, "Публічне управління та адміністрування/Публічне адміністрування та управління бізнесом" },
                    { 87, "281", 14, "Публічне управління та адміністрування/Публічне управління та адміністрування. Управління персоналом в органах публічної влади та бізнес-структурах" },
                    { 88, "072", 14, "Фінанси, банківська справа та страхування/Фінанси, митна та податкова справа" },
                    { 89, "072", 14, "Фінанси, банківська справа та страхування/Фінансовий менеджмент" },
                    { 90, "105", 15, "Прикладна фізика та наноматеріали/Комп’ютерні технології в прикладній фізиці. Нанофізика та наноматеріали" },
                    { 91, "014", 15, "Середня освіта/Середня освіта (Фізика)" },
                    { 92, "104", 15, "Фізика та астрономія/Квантові комп’ютери та квантове програмування" },
                    { 93, "104", 15, "Фізика та астрономія/Комп’ютерна фізика" },
                    { 94, "104", 15, "Фізика та астрономія/Фізика та астрофізика" },
                    { 95, "014", 16, "Середня освіта/Середня освіта (Українська мова і література)" },
                    { 96, "035", 16, "Філологія/Арабська мова та література, українська мова та література" },
                    { 97, "035", 16, "Філологія/Болгарська мова та література" },
                    { 98, "035", 16, "Філологія/Китайська мова та література, українська мова та література" },
                    { 99, "035", 16, "Філологія/Перська мова та література, українська мова та література" },
                    { 100, "035", 16, "Філологія/Польська мова та література" },
                    { 101, "035", 16, "Філологія/Прикладна лінгвістика" },
                    { 102, "035", 16, "Філологія/Українська мова та література" },
                    { 103, "035", 16, "Філологія/Українська мова та література (Літературна творчість)" },
                    { 104, "035", 16, "Філологія/Українська мова та література, українська мова як іноземна" },
                    { 105, "035", 16, "Філологія/Фольклористика" },
                    { 106, "035", 16, "Філологія/Хорватська мова та література" },
                    { 107, "035", 16, "Філологія/Чеська мова та література" },
                    { 108, "035", 16, "Філологія/Японська мова та література, українська мова та література" },
                    { 109, "014", 16, "Середня освіта/Середня освіта (Українська мова і література)" },
                    { 110, "035", 16, "Філологія/Арабська мова та література, українська мова та література" },
                    { 111, "035", 16, "Філологія/Болгарська мова та література" },
                    { 112, "035", 16, "Філологія/Китайська мова та література, українська мова та література" },
                    { 113, "035", 16, "Філологія/Перська мова та література, українська мова та література" },
                    { 114, "035", 16, "Філологія/Польська мова та література" },
                    { 115, "035", 16, "Філологія/Прикладна лінгвістика" },
                    { 116, "035", 16, "Філологія/Українська мова та література" },
                    { 117, "035", 16, "Філологія/Українська мова та література (Літературна творчість)" },
                    { 118, "035", 16, "Філологія/Українська мова та література, українська мова як іноземна" },
                    { 119, "035", 16, "Філологія/Фольклористика" },
                    { 120, "035", 16, "Філологія/Хорватська мова та література" },
                    { 121, "035", 16, "Філологія/Чеська мова та література" },
                    { 122, "035", 16, "Філологія/Японська мова та література, українська мова та література" },
                    { 123, "014", 18, "Середня освіта/Середня освіта (Хімія)" },
                    { 124, "102", 18, "Хімія" },
                    { 125, "081", 19, "Право" }
                });

            migrationBuilder.CreateIndex(
                name: "IX_Users_FacultyId",
                table: "Users",
                column: "FacultyId");

            migrationBuilder.CreateIndex(
                name: "IX_Users_SpecialityId",
                table: "Users",
                column: "SpecialityId");

            migrationBuilder.CreateIndex(
                name: "IX_Speciality_FacultyId",
                table: "Speciality",
                column: "FacultyId");

            migrationBuilder.AddForeignKey(
                name: "FK_Users_Faculty_FacultyId",
                table: "Users",
                column: "FacultyId",
                principalTable: "Faculty",
                principalColumn: "Id",
                onDelete: ReferentialAction.Cascade);

            migrationBuilder.AddForeignKey(
                name: "FK_Users_Speciality_SpecialityId",
                table: "Users",
                column: "SpecialityId",
                principalTable: "Speciality",
                principalColumn: "Id",
                onDelete: ReferentialAction.Cascade);
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropForeignKey(
                name: "FK_Users_Faculty_FacultyId",
                table: "Users");

            migrationBuilder.DropForeignKey(
                name: "FK_Users_Speciality_SpecialityId",
                table: "Users");

            migrationBuilder.DropTable(
                name: "Speciality");

            migrationBuilder.DropTable(
                name: "Faculty");

            migrationBuilder.DropIndex(
                name: "IX_Users_FacultyId",
                table: "Users");

            migrationBuilder.DropIndex(
                name: "IX_Users_SpecialityId",
                table: "Users");

            migrationBuilder.DropColumn(
                name: "FacultyId",
                table: "Users");

            migrationBuilder.DropColumn(
                name: "SpecialityId",
                table: "Users");

            migrationBuilder.AddColumn<string>(
                name: "Faculty",
                table: "Users",
                type: "text",
                nullable: true);
        }
    }
}
