using System.Security.Cryptography;
using Microsoft.EntityFrameworkCore;

namespace settings;
using db_namespace;
public class Seeders
{
    public static void Seed(ModelBuilder modelBuilder)
    {
        faculty_sead(modelBuilder);
        speciality_seed(modelBuilder);
    }
    private static void faculty_sead(ModelBuilder modelBuilder)
    {
        // Id, Name
        var faculty_list = new[] { 
            (1, "Біологічний факультет"), 
            (2, "Географічний факультет"),
            (3, "Геологічний факультет"), 
            (4, "Економічний факультет"), 
            (5, "Історичний факультет"), 
            (6, "Механіко-математичний факультет"), 
            (7, "Факультет електроніки та комп’ютерних технологій"), 
            (8, "Факультет журналістики"), 
            (9, "Факультет іноземних мов"), 
            (10, "Факультет культури і мистецтв"), 
            (11, "Факультет міжнародних відносин"), 
            (12, "Факультет педагогічної освіти"), 
            (13, "Факультет прикладної математики та інформатики"), 
            (14, "Факультет управління фінансами та бізнесу"), 
            (15, "Фізичний факультет"), 
            (16, "Філологічний факультет"), 
            (17, "Філософський факультет"), 
            (18, "Хімічний факультет"), 
            (19, "Юридичний факультет"), 
            (20, "Черкаське навчально-наукове відділення")
        };
        
        int i = 1;
        foreach (var faculty in faculty_list)
            modelBuilder.Entity<Faculty>().HasData(new Faculty{Id = faculty.Item1, Name = faculty.Item2});
        
    }

    private static void speciality_seed(ModelBuilder modelBuilder)
    {
        // ID, CODE, NAME, FACULTY_ID
        var speciality_list = new[] {
            (1, "091", "Біологія", 1),
            (2, "162", "Біотехнології та біоінженерія", 1),
            (3, "101", "Екологія", 1),
            (4, "014", "Середня освіта/Середня освіта (біологія та здоров’я людини)", 1),
            (5, "106", "Географія", 2),
            (6, "106", "Географія/Економічна і соціальна географія", 2),
            (7, "106", "Географія/Урбаністика, просторове планування і регіональний розвиток", 2),
            (8, "241", "Готельно-ресторанна справа", 2),
            (9, "103", "Науки про Землю/Геоекологія і прикладна геоморфологія", 2),
            (10, "103", "Науки про Землю/Ґрунтознавство та експертна оцінка земель", 2),
            (11, "014", "Середня освіта/Середня освіта (Географія)", 2),
            (12, "242", "Туризм/Туристична діяльність", 2),
            (13, "181", "Харчові технології", 2),
            (14, "103", "Науки про Землю/Геологія. Комп’ютерні технології в науках про Землю", 3),
            (15, "103", "Науки про Землю/Геотехнічний та екологічний інжиніринг", 3),
            (16, "051", "Економіка/Бізнес-економіка", 4),
            (17, "051", "Економіка/Економіка та правове регулювання в бізнесі", 4),
            (18, "051", "Економіка/Економічна аналітика та бізнес-статистика", 4),
            (19, "051", "Економіка/Економічна кібернетика", 4),
            (20, "051", "Економіка/Міжнародна економіка", 4),
            (21, "075", "Маркетинг", 4),
            (22, "073", "Менеджмент/Менеджмент організацій і адміністрування", 4),
            (23, "073", "Менеджмент/Менеджмент організацій і адміністрування. Інформаційні системи у менеджмент", 4),
            (24, "071", "Облік і оподаткування/Діджитал облік, бізнес-консалтинг і аудит", 4),
            (25, "071", "Облік і оподаткування/Облік, аналіз і оподаткування в бізнесі", 4),
            (26, "076", "Підприємництво, торгівля та біржова діяльність", 4),
            (27, "072", "Фінанси, банківська справа та страхування", 4),
            (28, "032", "Історія та археологія", 5),
            (29, "014", "Середня освіта/Середня освіта (Історія)", 5),
            (30, "054", "Соціологія/Прикладна соціологія. Бізнес-соціологія", 5),
            (31, "111", "Математика/Комп’ютерна алгебра, криптологія та теорія ігор", 6),
            (32, "111", "Математика/Комп’ютерний аналіз математичних моделей", 6),
            (33, "111", "Математика/Математика. Математична економіка та економетрика", 6),
            (34, "111", "Математика/Фінансова та страхова математика", 6),
            (35, "113", "Прикладна математика/Математичне моделювання та комп’ютерна механіка", 6),
            (36, "014", "Середня освіта/Середня освіта (Математика)", 6),
            (37, "112", "Статистика/Статистичний аналіз даних", 6),
            (38, "121", "Інженерія програмного забезпечення", 20),
            (39, "073", "Менеджмент", 20),
            (40, "071", "Облік і оподаткування", 20),
            (41, "081", "Право", 20),
            (42, "072", "Фінанси, банківська справа та страхування", 20),
            (43, "171", "Електроніка/Електроніка та комп’ютерні системи", 7),
            (44, "121", "Інженерія програмного забезпечення/Високопродуктивний комп’ютинг", 7),
            (45, "121", "Інженерія програмного забезпечення", 7),
            (46, "126", "Інформаційні системи та технології", 7),
            (47, "122", "Комп’ютерні науки", 7),
            (48, "153", "Мікро- та наносистемна техніка/Сенсорні та діагностичні електронні системи", 7),
            (49, "061", "Журналістика", 8),
            (50, "035", "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – англійська: переклад (англійська та друга іноземні мови))", 9),
            (51, "035", "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – німецька: німецька та англійська мови і літератури (переклад включно))", 9),
            (52, "035", "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – англійська: англійська та друга іноземні мови і літератури)", 9),
            (53, "035", "Філологія/Філологія (Германські мови та літератури (переклад включно), перша – німецька: переклад (німецька і друга іноземна мови, міжкультурна комунікація))", 9),
            (54, "035", "Філологія/Філологія (Класичні мови та літератури (переклад включно): класична філологія і англійська мова)", 9),
            (55, "035", "Філологія/Філологія (Романські мови та літератури (переклад включно), перша – іспанська: іспанська та англійська мови і літератури)", 9),
            (56, "035", "Філологія/Філологія (Романські мови та літератури (переклад включно), перша – французька: французька та англійська мови і літератури)", 9),
            (57, "029", "Інформаційна, бібліотечна та архівна справа", 10),
            (58, "028", "Менеджмент соціокультурної діяльності", 10),
            (59, "025", "Музичне мистецтво/Хорове диригування", 10),
            (60, "014", "Середня освіта/Середня освіта (Музичне мистецтво)", 10),
            (61, "026", "Сценічне мистецтво/Акторське мистецтво драматичного театру та кіно", 10),
            (62, "026", "Сценічне мистецтво/Театрознавство", 10),
            (63, "024", "Хореографія", 10),
            (64, "293", "Міжнародне право", 11),
            (65, "291", "Міжнародні відносини, суспільні комунікації та регіональні студії/Країнознавство", 11),
            (66, "291", "Міжнародні відносини, суспільні комунікації та регіональні студії/Міжнародна безпека та кризовий менеджмент", 11),
            (67, "291", "Міжнародні відносини, суспільні комунікації та регіональні студії/Міжнародна інформація", 11),
            (68, "291", "Міжнародні відносини, суспільні комунікації та регіональні студії/Міжнародні відносини", 11),
            (69, "292", "Міжнародні економічні відносини/Міжнародний бізнес", 11),
            (70, "292", "Міжнародні економічні відносини", 11),
            (71, "012", "Дошкільна освіта", 12),
            (72, "011", "Освітні, педагогічні науки/Організація освітнього простору. Позашкільна освіта.", 12),
            (73, "013", "Початкова освіта", 12),
            (74, "013", "Початкова освіта/Початкова освіта. Англійська мова у початковій школі", 12),
            (75, "013", "Початкова освіта/Початкова освіта. Інформатика у початковій школі", 12),
            (76, "231", "Соціальна робота/Соціальна педагогіка", 12),
            (77, "016", "Спеціальна освіта/Логопедія", 12),
            (78, "016", "Спеціальна освіта/Олігофренопедагогіка. Корекційна психопедагогіка", 12),
            (79, "125", "Кібербезпека/Кібербезпека. Кіберпезпека у фінансових технологіях", 13),
            (80, "122", "Комп’ютерні науки/Інформатика", 13),
            (81, "113", "Прикладна математика", 13),
            (82, "014", "Середня освіта/Середня освіта (Інформатика)", 13),
            (83, "124", "Системний аналіз/Системний аналіз і управління. Інтелектуальний аналіз даних", 13),
            (84, "051", "Економіка/Інформаційні технології в бізнесі", 14),
            (85, "071", "Облік і оподаткування/Облік, аналіз та фінансові розслідування", 14),
            (86, "281", "Публічне управління та адміністрування/Публічне адміністрування та управління бізнесом", 14),
            (87, "281", "Публічне управління та адміністрування/Публічне управління та адміністрування. Управління персоналом в органах публічної влади та бізнес-структурах", 14),
            (88, "072", "Фінанси, банківська справа та страхування/Фінанси, митна та податкова справа", 14),
            (89, "072", "Фінанси, банківська справа та страхування/Фінансовий менеджмент", 14),
            (90, "105", "Прикладна фізика та наноматеріали/Комп’ютерні технології в прикладній фізиці. Нанофізика та наноматеріали", 15),
            (91, "014", "Середня освіта/Середня освіта (Фізика)", 15),
            (92, "104", "Фізика та астрономія/Квантові комп’ютери та квантове програмування", 15),
            (93, "104", "Фізика та астрономія/Комп’ютерна фізика", 15),
            (94, "104", "Фізика та астрономія/Фізика та астрофізика", 15),
            (95, "014", "Середня освіта/Середня освіта (Українська мова і література)", 16),
            (96, "035", "Філологія/Арабська мова та література, українська мова та література", 16),
            (97, "035", "Філологія/Болгарська мова та література", 16),
            (98, "035", "Філологія/Китайська мова та література, українська мова та література", 16),
            (99, "035", "Філологія/Перська мова та література, українська мова та література", 16),
            (100, "035", "Філологія/Польська мова та література", 16),
            (101, "035", "Філологія/Прикладна лінгвістика", 16),
            (102, "035", "Філологія/Українська мова та література", 16),
            (103, "035", "Філологія/Українська мова та література (Літературна творчість)", 16),
            (104, "035", "Філологія/Українська мова та література, українська мова як іноземна", 16),
            (105, "035", "Філологія/Фольклористика", 16),
            (106, "035", "Філологія/Хорватська мова та література", 16),
            (107, "035", "Філологія/Чеська мова та література", 16),
            (108, "035", "Філологія/Японська мова та література, українська мова та література", 16),
            (109, "014", "Середня освіта/Середня освіта (Українська мова і література)", 16),
            (110, "035", "Філологія/Арабська мова та література, українська мова та література", 16),
            (111, "035", "Філологія/Болгарська мова та література", 16),
            (112, "035", "Філологія/Китайська мова та література, українська мова та література", 16),
            (113, "035", "Філологія/Перська мова та література, українська мова та література", 16),
            (114, "035", "Філологія/Польська мова та література", 16),
            (115, "035", "Філологія/Прикладна лінгвістика", 16),
            (116, "035", "Філологія/Українська мова та література", 16),
            (117, "035", "Філологія/Українська мова та література (Літературна творчість)", 16),
            (118, "035", "Філологія/Українська мова та література, українська мова як іноземна", 16),
            (119, "035", "Філологія/Фольклористика", 16),
            (120, "035", "Філологія/Хорватська мова та література", 16),
            (121, "035", "Філологія/Чеська мова та література", 16),
            (122, "035", "Філологія/Японська мова та література, українська мова та література", 16),
            (123, "014", "Середня освіта/Середня освіта (Хімія)", 18),
            (124, "102", "Хімія", 18),
            (125, "081", "Право", 19)
            };
        
        int i = 1;
        foreach (var speciality in speciality_list)
            modelBuilder.Entity<Speciality>().HasData(new Speciality{Id = speciality.Item1, Code = speciality.Item2, Name = speciality.Item3, FacultyId = speciality.Item4});
    }
}